org-files/sshfs-options-to-mount-remote-server-directory.org
#+SETUPFILE: setup/css/theme-0.orgcss
#+TITLE: sshfs通过用户和组映射挂载另一服务器的目录为本地目录

假设你在一台远程Linux服务器上有帐号和密码，而且有比较大的存储空间，想
mount到本地Linux来用，那么通过下面的命令即可：

#+BEGIN_SRC shell
sshfs -o nomap=ignore -o idmap=file -o uidfile=sshfs_uid_mapping -o gidfile=sshfs_gid_mapping md11235@192.168.100.193:/home/md11235 /home/md11235/node5
#+END_SRC

不过慢着，上面涉及两个文件呢，uidfile和gidfile。这里列出我用的 =sshfs_uid_mapping= ：

#+BEGIN_SRC shell
md11235:1001
#+END_SRC

其中md11235是本地Linux上你自己用的帐号（用户名），1001是你在远程服务器上的用户id（uid）。

另一份文件是 =sshfs_gid_mapping= ：

#+BEGIN_SRC shell
md11235:1002
#+END_SRC

同上，md11235是本地Linux上你的主组名，1002是你在远程服务器上的组id（gid）。

